In [3]:
import pandas as pd

In [4]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})

In [5]:
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

Merging tables, dropping columns in place,

In [6]:
person = person.merge(address, on = "personId", how = "outer")

In [7]:
person.drop(columns = ['addressId', 'personId'], inplace = True)

Dropping rows where firstName is null

In [8]:
person = person[~person['firstName'].isnull()]

Selecting columns

In [9]:
person[['firstName', 'lastName']]

  firstName lastName
0      Wang    Allen
1     Alice      Bob

In [41]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [42]:
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [45]:
df = employee.merge(right = employee,
    how = 'left',
    left_on = 'managerId',
    right_on = 'id')

In [46]:
df

   id_x name_x  salary_x  managerId_x  id_y name_y  salary_y  managerId_y
0     1    Joe     70000            3     3    Sam     60000         <NA>
1     2  Henry     80000            4     4    Max     90000         <NA>
2     3    Sam     60000         <NA>  <NA>    NaN      <NA>         <NA>
3     4    Max     90000         <NA>  <NA>    NaN      <NA>         <NA>

0    False
1     True
2     <NA>
3     <NA>
dtype: boolean

In [53]:
result = df[df['salary_y'] > df['salary_x']]['name_x']